{
  "currentWeek": {
    "date": "2025-03-12",
    "title": "EVOLUTION",
    "artist": "Jeff Mills, Jean-Phi Dary, Prabhu Edouard",
    "embed": "<iframe style=\"border: 0; width: 350px; height: 654px;\" src=\"https://bandcamp.com/EmbeddedPlayer/album=2793169642/size=large/bgcol=ffffff/linkcol=0687f5/transparent=true/\" seamless><a href=\"https://tomorrowcomestheharvest.bandcamp.com/album/evolution\">EVOLUTION by Jeff Mills, Jean-Phi Dary, Prabhu Edouard</a></iframe>",
    "description": "Tomorrow Comes The Harvest project started with late Tony Allen, one of the originators of AfroBeat and Jeff Mills to get together to create an improvisational type of performance. The idea was to not pre-prepare or to preplan anything, but just to play in the moment spontaneously and to reach for the same understanding musically. Jean-Phi Dary had been worked with Tony Allen for a long time, naturally joined the unit. After an untimely passing of Tony in 2020, they thought that maybe a good idea to continue with the project and to consider it in a much more broader respect other than just three main musicians that may be, it's interesting to make it open, to be able to invite other musicians in for certain concerts. They decided to invite Prabhu Edouard, who already had an experience of working with Jeff for classical concerts in France. The album was recorded live at Bozar in Brussels, Belgium in 2022."
  },
  
  "archive": [
    {
      "date": "2025-03-05",
      "title": "Blue Latin",
      "artist": "Gerardo Frisina",
      "embed": "<iframe style=\"border: 0; width: 350px; height: 654px;\" src=\"https://bandcamp.com/EmbeddedPlayer/album=467150494/size=large/bgcol=ffffff/linkcol=0687f5/transparent=true/\" seamless><a href=\"https://gerardo-frisina.bandcamp.com/album/blue-latin\">Blue Latin by Gerardo Frisina</a></iframe>",
      "description": "Blue Latin takes classic jazz and shakes it up with Afro-Cuban, Brazilian, and Latin-jazz vibes — all wrapped in Frisina's signature danceable style. It's the perfect soundtrack for a packed dance floor or a solo groove session at home. With standout tracks like the rework of João Donato's Naquela Base and the meditative, African-inspired Incanto, this album brings jazz right into the now."
    },
    {
      "date": "2025-02-26",
      "title": "Ten Ragas to a Disco Beat",
      "artist": "Charanjit Singh",
      "embed": "<div class=\"video-container\" style=\"position: relative; padding-bottom: 56.25%; height: 0; overflow: hidden; max-width: 100%;\"><iframe style=\"position: absolute; top: 0; left: 0; width: 100%; height: 100%;\" src=\"https://www.youtube.com/embed/as0uNNnkR_8?si=2Vq-1tM5WNXguwKf\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe></div>",
      "description": "'Ten Ragas to a Disco Beat' is a 1982 album by Indian musician Charanjit Singh that uniquely blends traditional Indian ragas with electronic disco music. Utilizing instruments like the Roland TB-303 bass synthesizer, TR-808 drum machine, and Jupiter-8 synthesizer, Singh crafted a sound that many consider a precursor to acid house music, predating the genre's rise in the late 1980s. Initially overlooked, the album gained recognition in the 21st century for its innovative fusion of classical Indian music and electronic dance rhythms."
    },
    {
      "date": "2025-02-19",
      "title": "Eastern Sounds",
      "artist": "Yusef Lateef",
      "embed": "<iframe style=\"border: 0; width: 100%; height: 470px;\" src=\"https://bandcamp.com/EmbeddedPlayer/album=1529149813/size=large/bgcol=f7f7f7/linkcol=e63946/track=654160980/transparent=true/\" seamless><a href=\"https://yuseflateef.bandcamp.com/album/eastern-sounds\">Eastern Sounds by Yusef Lateef</a></iframe>",
      "description": "Eastern Sounds is a studio album by the jazz multi-instrumentalist and composer Yusef Lateef. It was released in April 1962 through Prestige Records. This groundbreaking album reflects Lateef's exploration of Eastern musical traditions, combining them with Western jazz idioms to create a unique sonic landscape. His innovative approach to composition and instrumentation established him as one of the pioneers in world music fusion, decades before the term was widely used."
    }
  ]
}
